---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.CreationFailures
source: html/62f22d53-ffd1-5c31-12c2-9bf34a79f079.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures

Failures about CreationFailures.

## Syntax (C#)
```csharp
public static class CreationFailures
```